nc: 1

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]

# ==========================================
# 🟩 Backbone: 专注浅层与中层，彻底抛弃 P5
# ==========================================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2 (P2 特征) -> 保持绝对几何纯净，不加注意力保护微小边缘
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
# ... 前面的代码保持不变 ...
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, EMA, []]                  # 5 (P3_EMA) 🔥 修复：改为空列表
  - [-1, 1, Conv, [512, 3, 2]]        # 6-P4/16
  - [-1, 2, C3k2, [512, True]]        # 7
  - [-1, 1, SPPF, [512, 5]]           # 8
  - [-1, 1, EMA, []]                  # 9 (P4_EMA) 🔥 修复：改为空列表
# ... 后面的代码保持不变 ...

# ==========================================
# 🟦 Head: 纯净版 FPN + PAN (严禁此处出现注意力)
# ==========================================
head:
  # ⬇️ FPN 自顶向下: 全面回归最近邻插值 (Nearest)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 10 P4 -> P3
  - [[-1, 5], 1, Concat, [1]]                  # 11 融合提纯后的 P3_EMA (原索引 4 -> 5)
  - [-1, 2, C3k2, [256, False]]                # 12 (P3_td)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13 P3 -> P2
  - [[-1, 2], 1, Concat, [1]]                  # 14 融合最纯净的 Backbone P2 (索引 2 保持不变)
  - [-1, 2, C3k2, [128, False]]                # 15 (P2_td) 极高分辨率层生成完毕

  # ⬆️ PAN 自底向上: 路径聚合
  - [-1, 1, Conv, [128, 3, 2]]                 # 16 P2 -> P3 下采样
  - [[-1, 12], 1, Concat, [1]]                 # 17 融合 P3_td (原索引 10 -> 12)
  - [-1, 2, C3k2, [256, False]]                # 18 (P3_out)

  - [-1, 1, Conv, [256, 3, 2]]                 # 19 P3 -> P4 下采样
  - [[-1, 9], 1, Concat, [1]]                  # 20 融合深层 P4_EMA (原索引 7 -> 9)
  - [-1, 2, C3k2, [512, False]]                # 21 (P4_out)

  # ==========================================
  # 🟥 OBB 检测头: 接收重新对齐的 [P2, P3, P4]
  # ==========================================
  - [[15, 18, 21], 1, OBB, [nc, 1]]            # 22 Detect (更新路由索引)